---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningHangerDisconnects
source: html/60512dba-aa57-e123-8a06-f161ab30438a.htm
---
# Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningHangerDisconnects Property

Whether or not to show the graphical warnings for Fabrication Hanger disconnects.

## Syntax (C#)
```csharp
public bool ShowGraphicalWarningHangerDisconnects { get; set; }
```